Repository: common-repository/tb-enumerate
Catalog: languages/tb-enumerate-*.po
Languages: fr_fr

source: Enumerate
fr_fr: Enumérer

source: Number
fr_fr: Nombre

source: Enter a number in the list and then click the enumerate button
fr_fr: Saisissez un nombre à énumérer et sa base puis cliquez sur le bouton "Enumérer"

source: The following symbol in the left column is
fr_fr: La retenu est

source: To numerate for
fr_fr: On compte de

source: to
fr_fr: à

source: to base
fr_fr: en base

source: The rows (or columns) represent the position number of the component symbols. The first row number 0 is on the right
fr_fr: Les rangs (ou colonnes) représentent les positions des symboles composant le nombre. Le premier rang de numéro 0 est à droite

source: We have
fr_fr: Nous avons

source: available symbols in base
fr_fr: symboles disponibles en base

source: available symbols
fr_fr: symboles disponibles

source: in binary base
fr_fr: en base binaire

source: in quinary base
fr_fr: en base quinaire

source: in octal base
fr_fr: en base octale

source: in hexadecimal base
fr_fr: en base hexadécimale

source: in vigesimal base
fr_fr: en base vigésimale

source: binary base
fr_fr: base binaire

source: quinary base
fr_fr: base quinaire

source: octal base
fr_fr: base octale

source: hexadecimal base
fr_fr: base hexadécimale

source: vigesimal base
fr_fr: base vigésimale

source: or
fr_fr: ou bien

source: The base
fr_fr: La base

source: To the number
fr_fr: Pour le nombre

source: was binary number
fr_fr: on a en binaire le nombre

source: is used by our computers
fr_fr: est utilisé par nos ordinateurs

source: We group the consecutive numbers in binary quartets (from the right)
fr_fr: On groupe les chiffres consécutifs en quartets binaires (à partir de la droite)

source: We group the consecutive numbers in binary triplets (from the right)
fr_fr: On groupe les chiffres consécutifs en triplets binaires (à partir de la droite)

source: We group the consecutive numbers in binary quartets (from the right) with 8 bits (8 positions)
fr_fr: On groupe les chiffres consécutifs en quartets binaires (à partir de la droite) sur 8 bits (8 positions)

source: was used among the earliest civilizations and into the twentieth century by African peoples, but also partly in the Roman and Mayan ratings
fr_fr: était utilisée parmi les premières civilisations, et jusqu'au XXe siècle par des peuples africains, mais aussi, partiellement, dans les notations romaine et maya

source: is mainly used in computers. She can count from 0 to 255 in 2 positions (00 to FF)
fr_fr: est principalement utilisée en informatique. Elle permet de compter de 0 à 255 sur 2 positions (00 à FF)

source: Bhutan is Dzongkha language, and was in use among the Aztecs and for the Mayan count. Some think it was also used by the Gauls or the Basques in the early stages, but it is not actually count if their was a decimal character or vigesimal
fr_fr: existe au Bhoutan en langue dzongkha, et était en usage chez les Aztèques et, quoiqu'irrégulier, pour la numération maya. Certains pensent qu'elle a aussi été utilisée par les Gaulois ou par les Basques dans les premiers temps, mais on ignore en réalité si leur numération avait un caractère décimal ou vigésimal
